app/Controllers/Controlador.php

    function index($filtroestado = 'p') {

        // email test
        // $email= \Config\Services::email();
        // $email -> setFrom('mr.tasker.email@gmail.com','Mr. Tasker Administrador de tareas');
        // $email->setTo('bettinaa.jp@gmail.com');
        // $email -> setSubject('Test');
        // $email -> setMessage('Mail test contenido');
        // $email -> send();

        $sesion = session();

        if (!$sesion->has('userid')) {
            return view ('Login_Registro/index');
        }

        $tareaM = new TareaModel();
        $subtareaM = new SubtareaModel();
        $colabM = new \App\Models\ColaboracionModel();

        $tareas = $tareaM
            ->where('iddueño', $sesion->get('userid'))
            ->where('estado', $filtroestado)
            ->where('archivo', 0)
            ->orderBy("FIELD(prioridad, 'a', 'm', 'b')", '', false)
            ->orderBy('fvencimiento', 'ASC')
            ->findAll();
---
SELECT *
FROM `tareas`
WHERE `iddueño` = '2'
AND `estado` = 'd'
AND `archivo` = 0
ORDER BY FIELD(prioridad, 'a', 'm', 'b'), `fvencimiento` ASC

        ];

        foreach ($tareas as &$tarea) {
            $tarea['cantsubtareas'] = $subtareaM
                ->where('idtarea', $tarea['id'])
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `subtareas`
WHERE `idtarea` = '6'

    public function login(){
        $validar = service('validation'); //llamo al servicio de validacion
        $validar -> setRules ([
            'email' => 'required',
            'pass' => 'required' ] , [
            'email' => ['required' => 'El correo es obligatorio'] ,
            'pass' => ['required' => 'La contraseña es obligatoria']
        ]);
        if (!$validar -> withRequest($this->request) -> run()) {
            return redirect() -> back() -> withInput() -> with('errors',$validar->getErrors());
        }
        //control de email y pass
        $email = $this->request->getPost('email');
        $pass = $this->request->getPost('pass');

        $bdd = new \App\Models\UsuarioModel();

        $user = $bdd->where('email', $email)->first();
---
SELECT *
FROM `usuarios`
WHERE `email` = 'bettina321@gmail.com'
 LIMIT 1

    public function ver($id){
        if (!session()->get('userid')) { //control para no entrar sin sesion
            return redirect()->to('/');
        }
        $tareaM = new TareaModel();
        $subtareaM = new SubtareaModel();
        $colabM = new ColaboracionModel();
        $usuarioM = new UsuarioModel();
        $tarea = $tareaM->find($id);
---
SELECT *
FROM `tareas`
WHERE `tareas`.`id` = '1'

    public function delsubtarea($id, $idtarea) {
        $subM = new \App\Models\SubtareaModel();
        $tareaM = new \App\Models\TareaModel();

        $subM->delete($id);

        // actualiza el estado de la tarea
        $total = $subM->where('idtarea', $idtarea)->countAllResults();
        $completadas = $subM->where('idtarea', $idtarea)->where('estado', 'c')->countAllResults();
---
DELETE FROM `subtareas`
WHERE `id` IN ('4')
SELECT COUNT(*) AS `numrows`
FROM `subtareas`
WHERE `idtarea` = '1'
SELECT COUNT(*) AS `numrows`
FROM `subtareas`
WHERE `idtarea` = '1'
AND `estado` = 'c'

    public function actestado($id) {
        $sesion = session();
        $userid = $sesion->get('userid');

        $subM = new \App\Models\SubtareaModel();
        $tareaM = new \App\Models\TareaModel();

        $subtarea = $subM->find($id);
        // if (!$subtarea) {
        //     return redirect()->back()->with('error', 'Subtarea no encontrada');
        // }

        $nuevoEstado = $this->request->getPost('estado'.$id) === 'c' ? 'c' : 'd';
        $subM->update($id, ['estado' => $nuevoEstado]);

        $idtarea = $this->request->getPost('idtarea');
        $total = $subM->where('idtarea', $idtarea)->countAllResults();
---
SELECT *
FROM `subtareas`
WHERE `subtareas`.`id` = '20'
SELECT *
FROM `tareas`
WHERE `tareas`.`id` = '11'
UPDATE `subtareas` SET `estado` = 'c'
WHERE `subtareas`.`id` IN ('20')
SELECT COUNT(*) AS `numrows`
FROM `subtareas`
WHERE `idtarea` = '11'
AND `estado` = 'c'

            $nuevoEstadoTarea = 'p'; //en proceso
        }

        $tareaM->update($idtarea, ['estado' => $nuevoEstadoTarea]);
---
UPDATE `tareas` SET `estado` = 'p'
WHERE `tareas`.`id` IN ('11')

    public function invitar_colaborador() {
        $email = $this->request->getPost('col_email');
        $tipo = $this->request->getPost('col_rol'); // 'e' o 'l'
        $idtarea = $this->request->getPost('col_idtarea');
        $iddueno = session()->get('userid');

        $validar = service('validation');
        $validar->setRules([
            'col_email' => 'required',
        ] , [
            'col_email' => [ 'required' => 'El email es obligatorio']
        ]);
        if (!$validar->withRequest($this->request)->run()) {
            return redirect()->back()->with('errors_addcoop', $validar->getErrors());
        }

        // verificar usuario existente
        $usuarioM = new \App\Models\UsuarioModel();
        $usuario = $usuarioM->where('email', $email)->first();
---
SELECT *
FROM `usuarios`
WHERE `email` = 'bettinaa.jp@gmail.com'
 LIMIT 1

    public function cargar_toasts() {
        $userid = session()->get('userid');
        $tareaM = new \App\Models\TareaModel();
        $subtareaM = new \App\Models\SubtareaModel();

        $hoy = date('Y-m-d');
        $maniana = date('Y-m-d', strtotime('+1 day'));

        $toasts = [];

        // TAREAS
        $tareas = $tareaM->where('iddueño', $userid)
            ->where('estado !=', 'c')
            ->findAll();
---
SELECT *
FROM `tareas`
WHERE `iddueño` = '2'
AND `estado` != 'c'

        }

        // SUBTAREAS
        $subtareas = $subtareaM
            ->select('subtareas.*, tareas.iddueño')
            ->join('tareas', 'tareas.id = subtareas.idtarea')
            ->where('tareas.iddueño', $userid)
            ->where('subtareas.estado !=', 'c')
            ->findAll();
---
SELECT `subtareas`.*, `tareas`.`iddueño`
FROM `subtareas`
JOIN `tareas` ON `tareas`.`id` = `subtareas`.`idtarea`
WHERE `tareas`.`iddueño` = '2'
AND `subtareas`.`estado` != 'c'