app/Controllers/Controlador.php

    function index() {

        $sesion = session();

        if (!$sesion->has('userid')) {
            return view ('Login_Registro/index');
        }

        $tareaM = new TareaModel();
        $subtareaM = new SubtareaModel();

        $tareas = $tareaM
            ->where('iddueño', $sesion->get('userid'))
            ->orderBy("FIELD(prioridad, 'a', 'm', 'b')", '', false)
            ->orderBy('fvencimiento', 'ASC')
            ->findAll();
---
SELECT *
FROM `tareas`
WHERE `iddueño` = '6'
ORDER BY FIELD(prioridad, 'a', 'm', 'b'), `fvencimiento` ASC

    public function ver($id){
        if (!session()->get('userid')) { //control para no entrar sin sesion
            return redirect()->to('/');
        }
        $tareaM = new TareaModel();
        $subtareaM = new SubtareaModel();
        $tarea = $tareaM->find($id);
---
SELECT *
FROM `tareas`
WHERE `tareas`.`id` = '11'

    function get_perfil(){
        $sesion = session();
        $userid = $sesion->get('userid');

        $tareaM = new \App\Models\TareaModel();
        $userM = new \App\Models\UsuarioModel();
        $tareas_creadas = $tareaM->where('iddueño', $userid)->countAllResults();
        $tareas_terminadas = $tareaM->where(['iddueño' => $userid, 'estado' => 'c'])->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tareas`
WHERE `iddueño` = '6'
SELECT COUNT(*) AS `numrows`
FROM `tareas`
WHERE `iddueño` = '6'
AND `estado` = 'c'