app/Controllers/Controlador.php

    public function actestado($id) {
        $subM = new \App\Models\SubtareaModel();
        $tareaM = new \App\Models\TareaModel();

        $subtarea = $subM->find($id);
        // if (!$subtarea) {
        //     return redirect()->back()->with('error', 'Subtarea no encontrada');
        // }

        $nuevoEstado = $this->request->getPost('estado'.$id) === 'c' ? 'c' : 'd';
        $subM->update($id, ['estado' => $nuevoEstado]);
---
SELECT *
FROM `subtareas`
WHERE `subtareas`.`id` = '18'
UPDATE `subtareas` SET `estado` = 'c'
WHERE `subtareas`.`id` IN ('18')
UPDATE `tareas` SET `estado` = 'c'
WHERE `tareas`.`id` IN ('7')

        $color = [1 => '#9ac8ff', 2 => '#96db9d', 3 => '#ff9c9c', 4 => '#ffe885', 5 => '#d29fd6'];

        foreach ($tareas as &$tarea) {
            $tarea['cantsubtareas'] = $subtareaM->where('idtarea', $tarea['id'])->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `subtareas`
WHERE `idtarea` = '14'